app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
    <strong>
    <%= pluralize(post.comments.count, 'comment') %>