app/controllers/comments_controller.rb

    def create
        @post.comments.create! params.required(:comment).permit(:content)
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["content", "sdffdsfds"], ["created_at", "2022-02-04 09:19:23.816035"], ["updated_at", "2022-02-04 09:19:23.816035"]]

    def set_post
        @post = Post.friendly.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]