app/controllers/posts_controller.rb

INSERT INTO "posts" ("tilte", "content", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["tilte", "the post to test url"], ["content", nil], ["created_at", "2022-02-09 10:52:47.073680"], ["updated_at", "2022-02-09 10:52:47.073680"], ["slug", "the-post-to-test-url"]]
---
  def create
    @post = Post.new(post_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ?, "slug" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-02-09 10:36:26.422553"], ["slug", "first-test-post"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.friendly.find(params[:id])